Autodesk.Revit.DB.OrdinateOriginVisibility
The ordinate origin visibility.
Since:
2017 Subscription Update
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateOriginVisibility.WitnessLineOnly
Shows the origin witness line and tick mark.

Autodesk.Revit.DB.OrdinateOriginVisibility.WitnessLineWithText
Shows the origin witness line, tick mark and text (0'-0").

Autodesk.Revit.DB.OrdinateOriginVisibility.None
Does not show the origin witness line, tick mark, or text (0'-0").